In [7]:
import pandas as pd
import numpy as np

data = {
    '이름': ['철수', '영희', '경준'],
    '나이': [23,21,25],
    '점수': [85, 90, 88]
}
df = pd.DataFrame(data)
print(df.head())

   이름  나이  점수
0  철수  23  85
1  영희  21  90
2  경준  25  88

In [5]:
dates = pd.date_range('20130101', periods = 6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [9]:
df = pd.DataFrame(np.random.randn(6, 4), index = dates, columns = list('ABCD'))
df

                   A         B         C         D
2013-01-01  1.390723  0.179176  2.420332  1.286137
2013-01-02 -0.012869 -1.907254  1.068308 -0.412241
2013-01-03 -0.590739  1.079376 -0.844831  1.422674
2013-01-04 -0.590682  0.304265  1.422940 -1.484176
2013-01-05  0.546424  0.372364  0.619818 -0.547442
2013-01-06  1.375560 -1.793054  0.823067 -1.044038

In [18]:
df2 = pd.DataFrame(
    {
        'A': 1.0,
        'B': pd.Timestamp('20130102'),
        'C': pd.Series(1, index = list(range(4)), dtype = 'float32'),
        'D': np.array([3] * 4, dtype = 'int32'),
        'E': pd.Categorical(['test', 'train', 'test', 'train']),
        'F': 'foo'
    }
)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [20]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [40]:
df.head()

                   A         B         C         D
2013-01-01  1.390723  0.179176  2.420332  1.286137
2013-01-02 -0.012869 -1.907254  1.068308 -0.412241
2013-01-03 -0.590739  1.079376 -0.844831  1.422674
2013-01-04 -0.590682  0.304265  1.422940 -1.484176
2013-01-05  0.546424  0.372364  0.619818 -0.547442

In [44]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.590682  0.304265  1.422940 -1.484176
2013-01-05  0.546424  0.372364  0.619818 -0.547442
2013-01-06  1.375560 -1.793054  0.823067 -1.044038

In [46]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [50]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [56]:
df.to_numpy()

array([[ 1.39072264,  0.17917599,  2.4203319 ,  1.28613694],
       [-0.01286905, -1.90725359,  1.06830785, -0.41224147],
       [-0.59073858,  1.079376  , -0.8448311 ,  1.42267398],
       [-0.59068224,  0.30426507,  1.42294001, -1.48417621],
       [ 0.54642399,  0.37236445,  0.61981788, -0.54744201],
       [ 1.3755598 , -1.79305351,  0.82306737, -1.04403754]])

In [ ]:
#--------------------------------------------------------------------

In [60]:
import pandas as pd
import numpy as np

In [66]:
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
print(mydict)
pd.Series(mydict)

{'a': 0, 'b': 1, 'c': 2, 'e': 3, 'd': 4, 'f': 5, 'g': 6, 'h': 7, 'i': 8, 'j': 9, 'k': 10, 'l': 11, 'm': 12, 'n': 13, 'o': 14, 'p': 15, 'q': 16, 'r': 17, 's': 18, 't': 19, 'u': 20, 'v': 21, 'w': 22, 'x': 23, 'y': 24, 'z': 25}

a     0
b     1
c     2
e     3
d     4
f     5
g     6
h     7
i     8
j     9
k    10
l    11
m    12
n    13
o    14
p    15
q    16
r    17
s    18
t    19
u    20
v    21
w    22
x    23
y    24
z    25
dtype: int32

In [68]:
ser1 = pd.Series(mylist)
ser2 = pd.Series(myarr)
ser3 = pd.Series(mydict)
print(ser3.head())

a    0
b    1
c    2
e    3
d    4
dtype: int32